---
kind: property
id: P:Autodesk.Revit.DB.HostedSweep.Angle
source: html/beb95fa6-6296-2631-f30c-1fc71b3b03c5.htm
---
# Autodesk.Revit.DB.HostedSweep.Angle Property

Retrieve/set the angle of the hosted sweep object relative its references (Unit : Radian).

## Syntax (C#)
```csharp
public double Angle { get; set; }
```